calciteNL/system/blockMeshDict
/*------------------------------*- C++ -*--------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices        
(
    (0   -2.5e4 -0.5) 
    (0   -2.5e4  0.5) 
    (0    2.5e4 -0.5) 
    (0    2.5e4  0.5) 
    (1e5 -2.5e4 -0.5) 
    (1e5 -2.5e4  0.5) 
    (1e5  2.5e4 -0.5) 
    (1e5  2.5e4  0.5) 
);

blocks          
(
    hex (0  4  6  2  1  5  7  3) (1000 500 1) simpleGrading (1 1 1)
);

boundary
(
    inlet 
    {
        type patch;
        faces
        (
            (0  1  3  2 )
        );
    }

    outlet
    {
         type patch;
         faces
         (
            (4  6  7  5)
         );
    }   

    y1 
    {
        type cyclic;
        neighbourPatch y2;
        faces
        (
            (0  4  5  1)
        );
    }   

    y2 
    {
        type cyclic;
        neighbourPatch y1;
        faces
        (
            (2  3  7  6)
        );
    }   

    z1 
    {
        type empty;
        faces
        (
            (0  4  6  2)
        );
    }   

    z2 
    {
        type empty;
        faces
        (
            (1  3  7  5)
        );
    }   
);

// ********************************************************************* //

